Tekla Open API Reference for Tekla Structures 2025
Grid.GridAttributes Class
 The GridAttributes class is the attributes class for the grid.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Grid.GridAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GridAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class GridAttributes
	Inherits AttributesBase
The Grid.GridAttributes type exposes the following members.
Constructors
Name | Description
Grid.GridAttributes()
 Creates a new default grid attributes instance that loads standard attributes.
Grid.GridAttributes(String)
 Creates a new grid attributes instance that loads the specified attributes.
Top
Properties
Name | Description
DrawOnlyTextLabelsNotGrids
 Set as true if you don't want to draw the grids, only show the grids' text labels.
DrawTextAtBottomOfGrid
 Set as true if you want to show the grid's text labels at the bottom of the grid.
DrawTextAtLeftOfGrid
 Set as true if you want to show the grid's text labels at the left of the grid.
DrawTextAtRightOfGrid
 Set as true if you want to show the grid's text labels at the right of the grid.
DrawTextAtTopOfGrid
 Set as true if you want to show the grid's text labels at the top of the grid.
Font
 The grid's font attributes.
Frame
 The frame attributes of the grid's labels.
Line
 The grid's line attributes.
OffsetAtEndOfLine
 The offset for the end of the grid lines.
OffsetAtStartOfLine
 The offset for the beginning of the grid lines.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace